In [14]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [15]:
## load the dataset

df = pd.read_csv('HR_Analytics_Data.csv')
df

,id,first_name,last_name,birthdate,Age,gender,race,department,jobtitle,location,hire_date,termdate,location_city,location_state
0,00-0037846,Kimmy,Walczynski,04-06-1991,31,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,20-01-2002,NaN,Cleveland,Ohio
1,00-0041533,Ignatius,Springett,29-06-1984,38,Male,White,Business Development,Business Analyst,Headquarters,08-04-2019,NaN,Cleveland,Ohio
2,00-0045747,Corbie,Bittlestone,29-07-1989,33,Male,Black or African American,Sales,Solutions Engineer Manager,Headquarters,12-10-2010,NaN,Cleveland,Ohio
3,00-0055274,Baxy,Matton,14-09-1982,40,Female,White,Services,Service Tech,Headquarters,10-04-2005,NaN,Cleveland,Ohio
4,00-0076100,Terrell,Suff,11-04-1994,28,Female,Two or More Races,Product Management,Business Analyst,Remote,29-09-2010,2029-10-29 06:09:38 UTC,Flint,Michigan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
22209,99-9797418,Dorella,Garvan,08-07-1998,24,Female,Hispanic or Latino,Research and Development,Research Assistant I,Headquarters,08-02-2012,NaN,Cleveland,Ohio
22210,99-9869877,Dasie,Thorsby,19-04-2001,21,Female,Two or More Races,Services,Service Manager,Headquarters,06-10-2017,NaN,Cleveland,Ohio
22211,99-9919822,Nerty,Wilding,09-02-1970,53,Female,Two or More Races,Training,Junior Trainer,Headquarters,08-02-2001,NaN,Cleveland,Ohio
22212,99-9960380,Mabelle,Dawks,02-09-1985,37,Male,Two or More Races,Accounting,Staff Accountant I,Headquarters,03-04-2005,2012-12-10 14:29:59 UTC,Cleveland,Ohio
22213,99-9963543,Carroll,Chattaway,10-07-1999,23,Female,White,Engineering,Software Engineer III,Remote,27-03-2018,NaN,Fort Wayne,Indiana

,id,first_name,last_name,birthdate,Age,gender,race,department,jobtitle,location,hire_date,termdate,location_city,location_state
0,00-0037846,Kimmy,Walczynski,04-06-1991,31,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,20-01-2002,NaN,Cleveland,Ohio
1,00-0041533,Ignatius,Springett,29-06-1984,38,Male,White,Business Development,Business Analyst,Headquarters,08-04-2019,NaN,Cleveland,Ohio
2,00-0045747,Corbie,Bittlestone,29-07-1989,33,Male,Black or African American,Sales,Solutions Engineer Manager,Headquarters,12-10-2010,NaN,Cleveland,Ohio
3,00-0055274,Baxy,Matton,14-09-1982,40,Female,White,Services,Service Tech,Headquarters,10-04-2005,NaN,Cleveland,Ohio
4,00-0076100,Terrell,Suff,11-04-1994,28,Female,Two or More Races,Product Management,Business Analyst,Remote,29-09-2010,2029-10-29 06:09:38 UTC,Flint,Michigan

In [4]:
df.tail()

,id,first_name,last_name,birthdate,Age,gender,race,department,jobtitle,location,hire_date,termdate,location_city,location_state
22209,99-9797418,Dorella,Garvan,08-07-1998,24,Female,Hispanic or Latino,Research and Development,Research Assistant I,Headquarters,08-02-2012,NaN,Cleveland,Ohio
22210,99-9869877,Dasie,Thorsby,19-04-2001,21,Female,Two or More Races,Services,Service Manager,Headquarters,06-10-2017,NaN,Cleveland,Ohio
22211,99-9919822,Nerty,Wilding,09-02-1970,53,Female,Two or More Races,Training,Junior Trainer,Headquarters,08-02-2001,NaN,Cleveland,Ohio
22212,99-9960380,Mabelle,Dawks,02-09-1985,37,Male,Two or More Races,Accounting,Staff Accountant I,Headquarters,03-04-2005,2012-12-10 14:29:59 UTC,Cleveland,Ohio
22213,99-9963543,Carroll,Chattaway,10-07-1999,23,Female,White,Engineering,Software Engineer III,Remote,27-03-2018,NaN,Fort Wayne,Indiana

In [5]:
df.sample(10)

,id,first_name,last_name,birthdate,Age,gender,race,department,jobtitle,location,hire_date,termdate,location_city,location_state
19451,87-4245271,Aundrea,Dufore,29-04-1988,34,Female,Asian,Accounting,Accountant III,Headquarters,20-03-2007,NaN,Cleveland,Ohio
4648,20-9854447,Clarice,Driuzzi,24-01-1992,31,Female,Hispanic or Latino,Engineering,Automation Specialist III,Remote,20-09-2014,NaN,Reading,Pennsylvania
7001,31-7159927,Flossi,Scutchin,25-10-2000,22,Female,Two or More Races,Services,Service Tech II,Remote,23-08-2017,NaN,Lansing,Michigan
6919,31-3263710,Deena,Du Plantier,21-05-2001,21,Female,Two or More Races,Sales,Account Manager,Headquarters,13-11-2002,NaN,Cleveland,Ohio
13399,60-3340072,Agathe,Liddall,27-03-1991,32,Female,White,Support,Desktop Support Technician,Remote,17-12-2010,NaN,Springfield,Illinois
1694,07-6268630,Babette,Drohun,14-02-1988,35,Female,Hispanic or Latino,Business Development,Research Assistant II,Remote,06-12-2007,NaN,Detroit,Michigan
3485,15-6874809,Doug,Gerrels,10-12-1998,24,Female,White,Services,Service Manager,Headquarters,24-03-2010,NaN,Cleveland,Ohio
9641,43-4815597,Scotti,Scheffler,05-11-1985,37,Male,Hispanic or Latino,Accounting,Budget/Accounting Analyst I,Remote,21-03-2006,NaN,Cincinnati,Ohio
1516,06-8280505,Ian,Odgers,18-11-1996,26,Male,American Indian or Alaska Native,Human Resources,Human Resources Analyst II,Headquarters,20-12-2004,2016-12-02 09:33:22 UTC,Cleveland,Ohio
13466,60-6366459,Jessalyn,Dautry,07-07-1976,46,Male,Two or More Races,Training,Senior Trainer,Headquarters,26-10-2010,NaN,Cleveland,Ohio

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22214 entries, 0 to 22213
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              22214 non-null  object
 1   first_name      22214 non-null  object
 2   last_name       22214 non-null  object
 3   birthdate       22214 non-null  object
 4   Age             22214 non-null  int64
 5   gender          22214 non-null  object
 6   race            22214 non-null  object
 7   department      22214 non-null  object
 8   jobtitle        22214 non-null  object
 9   location        22214 non-null  object
 10  hire_date       22214 non-null  object
 11  termdate        3929 non-null   object
 12  location_city   22214 non-null  object
 13  location_state  22214 non-null  object
dtypes: int64(1), object(13)
memory usage: 2.4+ MB

In [7]:
df.describe()

                Age
count  22214.000000
mean      38.428559
std       10.653415
min       20.000000
25%       29.000000
50%       38.000000
75%       48.000000
max       57.000000

In [8]:
df.shape

(22214, 14)

In [9]:
## check the null values

df.isnull().sum()

id                    0
first_name            0
last_name             0
birthdate             0
Age                   0
gender                0
race                  0
department            0
jobtitle              0
location              0
hire_date             0
termdate          18285
location_city         0
location_state        0
dtype: int64

In [17]:
#new column 

df['Joined Year'] = pd.to_datetime(df['hire_date']).dt.year
df.head()

,id,first_name,last_name,birthdate,Age,gender,race,department,jobtitle,location,hire_date,termdate,location_city,location_state,Joined Year
0,00-0037846,Kimmy,Walczynski,04-06-1991,31,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,20-01-2002,NaN,Cleveland,Ohio,2002
1,00-0041533,Ignatius,Springett,29-06-1984,38,Male,White,Business Development,Business Analyst,Headquarters,08-04-2019,NaN,Cleveland,Ohio,2019
2,00-0045747,Corbie,Bittlestone,29-07-1989,33,Male,Black or African American,Sales,Solutions Engineer Manager,Headquarters,12-10-2010,NaN,Cleveland,Ohio,2010
3,00-0055274,Baxy,Matton,14-09-1982,40,Female,White,Services,Service Tech,Headquarters,10-04-2005,NaN,Cleveland,Ohio,2005
4,00-0076100,Terrell,Suff,11-04-1994,28,Female,Two or More Races,Product Management,Business Analyst,Remote,29-09-2010,2029-10-29 06:09:38 UTC,Flint,Michigan,2010